{"data":{"markdownRemark":{"html":"<h2 id=\"about-the-project\"><a href=\"#about-the-project\" aria-label=\"about the project permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>About the project:</h2>\n<p>Can you remember that last time you cleaned your fridge? Changed your air filters? Mowed the lawn? Life moves fast and it’s easy to forget all that you have to do to maintain a clean home, that’s where Keep Up comes into play. With a rotating assignment schedule, you can create tasks, assign their frequency, and assign a rotation of who should complete the task. With Keep Up’s interactive dashboard, you can see what you need to get done each week, check your progress, and see the progress of your roommates on their tasks.</p>\n<p>Josh Black and I started Keep Up to solve our own roommate disputes and to have a place to clearly communicate what needs to be done around the house. We needed it and we figured other people did too.</p>\n<p><a href=\"https://keepup.company\">Project</a></p>\n<p>Project on <a href=\"https://github.com/abbeyhrt/keep-up\">Github</a></p>\n<p>So far, to develop Keep Up, I have used the following technologies:</p>\n<ul>\n<li>GraphQL</li>\n<li>Apollo</li>\n<li>Go</li>\n<li>React.js</li>\n<li>IBM Cloud</li>\n<li>create-react-app for UI</li>\n<li>Docker</li>\n<li>Postgres</li>\n<li>Sass</li>\n<li>Nginx for proxy</li>\n</ul>\n<p>In order to query the database, created using Postgres, I used Graphql, specifically Go’s graphql-go package, to get back the information I needed and nothing more. I found Graphql’s query structure and resolver pattern to be simple to use and quick to implement. I look forward to using Graphql more and more to unleash its full potential! Here are some example queries and mutations that I created using Graphql for Keep Up.</p>\n<div class=\"post__images\">\n  <img class=\"post__image\" src=\"/portfolio/images/graphql-query-viewer.png\">\n  <img class=\"post__image\" src=\"/portfolio/images/Graphql-query-mutation.png\">\n</div>\n<p>In tandem with Graphql, I used Apollo Client to recieve my queried information and display it on the UI. Apollo and React.js go well together and Apollo made it easy to divide the queries and mutations into different reusable components so I could put them anywhere they were needed within the site.</p>\n<p>Keep Up is a work in progress but the current version of the site is deployed on IBM Cloud using Docker and Cloud foundry, using the <code class=\"language-text\">ibmcloud</code> CLI tool to help automate deployments through CircleCI. We also used IBM Cloud’s custom DNS option to serve our project on a custom vanity URL and let’s encrypt to set up HTTPS.</p>","frontmatter":{"title":"Keep Up","description":"A web application that provides a way to keep track and keep up with all you and your roommates' household chores.","date":2018},"timeToRead":2}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/projects/keep-up/"}}